Revit 2026 API

# EffectInstanceSetAmbientColor Method

---

Sets the ambient color parameter of the effect instance.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetAmbientColor(
	Color color
)
```
```vb
Public Sub SetAmbientColor (
	color As Color
)
```
```cpp
public:
void SetAmbientColor(
	Color^ color
)
```
```fsharp
member SetAmbientColor :
        color : Color -> unit
```

#### Parameters

color Color
     The ambient color value.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

EffectInstance Class

Autodesk.Revit.DB.DirectContext3D Namespace